app/views/home/index.html.haml

%section
  - ww = WorksWith.where(is_live: true)
---
SELECT "works_withs".* FROM "works_withs" WHERE "works_withs"."is_live" = $1  [["is_live", "t"]]

    = Faker::Lorem.sentence
  - testimonials = Testimonial.where(is_live: true)
---
SELECT "testimonials".* FROM "testimonials" WHERE "testimonials"."is_live" = $1  [["is_live", "t"]]