app/controllers/apps_controller.rb

UPDATE "apps" SET "description" = $1, "updated_at" = $2 WHERE "apps"."id" = $3  [["description", "Voluptatem amet numquam aut."], ["updated_at", "2018-11-30 11:29:50.756983"], ["id", 15]]
---
  def update
    respond_to do |format|
      if @app.update(app_params)

DELETE FROM "apps" WHERE "apps"."id" = $1  [["id", 20]]
---
  def destroy
    @app.destroy

SELECT  "apps".* FROM "apps" WHERE "apps"."id" = $1 LIMIT $2  [["id", 20], ["LIMIT", 1]]
---
  def set_app
    @app = App.find(params[:id])