app/controllers/developers_controller.rb

UPDATE "developers" SET "description" = $1, "url" = $2, "updated_at" = $3 WHERE "developers"."id" = $4  [["description", "Dolores magni ut quia."], ["url", "http://roberts.org/maria"], ["updated_at", "2018-11-30 11:29:51.974890"], ["id", 84]]
---
  def update
    respond_to do |format|
      if @developer.update(developer_params)

DELETE FROM "developers" WHERE "developers"."id" = $1  [["id", 88]]
---
  def destroy
    @developer.destroy

SELECT  "developers".* FROM "developers" WHERE "developers"."id" = $1 LIMIT $2  [["id", 88], ["LIMIT", 1]]
---
  def set_developer
    @developer = Developer.find(params[:id])