app/controllers/distributors_controller.rb

  def update
    respond_to do |format|
      if @distributor.update(distributor_params)
---
UPDATE "distributors" SET "badge_image_url" = $1, "updated_at" = $2 WHERE "distributors"."id" = $3  [["badge_image_url", "http://bernhard.io/olevia"], ["updated_at", "2018-11-30 11:29:50.944361"], ["id", 18]]

  def destroy
    @distributor.destroy
---
DELETE FROM "distributors" WHERE "distributors"."id" = $1  [["id", 16]]

  def set_distributor
    @distributor = Distributor.find(params[:id])
---
SELECT  "distributors".* FROM "distributors" WHERE "distributors"."id" = $1 LIMIT $2  [["id", 21], ["LIMIT", 1]]