app/controllers/distributor_links_controller.rb

  def update
    respond_to do |format|
      if @distributor_link.update(distributor_link_params)
---
UPDATE "distributor_links" SET "link" = $1, "updated_at" = $2 WHERE "distributor_links"."id" = $3  [["link", "http://sawaynwatsica.biz/lorraine_leannon"], ["updated_at", "2018-11-30 11:29:52.103384"], ["id", 54]]

  def destroy
    @distributor_link.destroy
---
DELETE FROM "distributor_links" WHERE "distributor_links"."id" = $1  [["id", 48]]

  def set_distributor_link
    @distributor_link = DistributorLink.find(params[:id])
---
SELECT  "distributor_links".* FROM "distributor_links" WHERE "distributor_links"."id" = $1 LIMIT $2  [["id", 63], ["LIMIT", 1]]