app/controllers/example_images_controller.rb

UPDATE "example_images" SET "image_url" = $1, "caption" = $2, "updated_at" = $3 WHERE "example_images"."id" = $4  [["image_url", nil], ["caption", "Magnam corporis sapiente minus."], ["updated_at", "2018-11-30 11:29:51.240825"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @example_image.update(example_image_params)

DELETE FROM "example_images" WHERE "example_images"."id" = $1  [["id", 5]]
---
  def destroy
    @example_image.destroy

SELECT  "example_images".* FROM "example_images" WHERE "example_images"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
  def set_example_image
    @example_image = ExampleImage.find(params[:id])