app/controllers/offerings_controller.rb

UPDATE "offerings" SET "description" = $1, "shop_link" = $2, "updated_at" = $3 WHERE "offerings"."id" = $4  [["description", "Quo eum quod tempora."], ["shop_link", "http://bodearmstrong.co/yahaira.batz"], ["updated_at", "2018-11-30 11:29:51.115404"], ["id", 27]]
---
  def update
    respond_to do |format|
      if @offering.update(offering_params)

DELETE FROM "offerings" WHERE "offerings"."id" = $1  [["id", 24]]
---
  def destroy
    @offering.destroy

SELECT  "offerings".* FROM "offerings" WHERE "offerings"."id" = $1 LIMIT $2  [["id", 27], ["LIMIT", 1]]
---
  def set_offering
    @offering = Offering.find(params[:id])