app/controllers/testimonial_slides_controller.rb

  def update
    respond_to do |format|
      if @testimonial_slide.update(testimonial_slide_params)
---
UPDATE "testimonial_slides" SET "image_url" = $1, "caption" = $2, "updated_at" = $3 WHERE "testimonial_slides"."id" = $4  [["image_url", nil], ["caption", "Veritatis odio distinctio ut."], ["updated_at", "2018-12-03 16:51:49.635543"], ["id", 4]]

  def destroy
    @testimonial_slide.destroy
---
DELETE FROM "testimonial_slides" WHERE "testimonial_slides"."id" = $1  [["id", 1]]

  def set_testimonial_slide
    @testimonial_slide = TestimonialSlide.find(params[:id])
---
SELECT  "testimonial_slides".* FROM "testimonial_slides" WHERE "testimonial_slides"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]