app/controllers/testimonials_controller.rb

UPDATE "testimonials" SET "description" = $1, "updated_at" = $2 WHERE "testimonials"."id" = $3  [["description", "Et esse consectetur dolorem."], ["updated_at", "2018-11-30 11:29:51.584463"], ["id", 4]]
---
  def update
    respond_to do |format|
      if @testimonial.update(testimonial_params)

DELETE FROM "testimonials" WHERE "testimonials"."id" = $1  [["id", 2]]
---
  def destroy
    @testimonial.destroy

SELECT  "testimonials".* FROM "testimonials" WHERE "testimonials"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def set_testimonial
    @testimonial = Testimonial.find(params[:id])