app/controllers/use_cases_controller.rb

UPDATE "use_cases" SET "description" = $1, "updated_at" = $2 WHERE "use_cases"."id" = $3  [["description", "Nulla in consectetur aut."], ["updated_at", "2018-11-30 11:29:51.726959"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @use_case.update(use_case_params)

DELETE FROM "use_cases" WHERE "use_cases"."id" = $1  [["id", 4]]
---
  def destroy
    @use_case.destroy

SELECT  "use_cases".* FROM "use_cases" WHERE "use_cases"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
  def set_use_case
    @use_case = UseCase.find(params[:id])