app/controllers/works_withs_controller.rb

UPDATE "works_withs" SET "description" = $1, "updated_at" = $2 WHERE "works_withs"."id" = $3  [["description", "Qui est perspiciatis qui."], ["updated_at", "2018-11-30 11:29:44.641663"], ["id", 3]]
---
  def update
    respond_to do |format|
      if @works_with.update(works_with_params)

DELETE FROM "works_withs" WHERE "works_withs"."id" = $1  [["id", 12]]
---
  def destroy
    @works_with.destroy

SELECT  "works_withs".* FROM "works_withs" WHERE "works_withs"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
---
  def set_works_with
    @works_with = WorksWith.find(params[:slug])