app/views/testimonials/show.html.haml

          -if paragraph_tracker == midway
            - slide_number = @testimonial.testimonial_slides.length
---
SELECT "testimonial_slides".* FROM "testimonial_slides" WHERE "testimonial_slides"."testimonial_id" = $1  [["testimonial_id", 1]]

    %ul{:class=>'distributor-links'}
      - @testimonial.works_with.app.distributor_links.each do |dl|
---
SELECT  "apps".* FROM "apps" WHERE "apps"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "distributor_links".* FROM "distributor_links" WHERE "distributor_links"."app_id" = $1  [["app_id", 1]]